In [1]:
import numpy as np

In [ ]:
x = np.array([1, 2, 3, 4, 5])
np.save('my_array', x)
y = np.load('my_array.npy')

In [11]:
np.diag([11,12,13,14])

array([[11,  0,  0,  0],
       [ 0, 12,  0,  0],
       [ 0,  0, 13,  0],
       [ 0,  0,  0, 14]])

In [12]:
np.linspace(1,25,50)

array([ 1.        ,  1.48979592,  1.97959184,  2.46938776,  2.95918367,
        3.44897959,  3.93877551,  4.42857143,  4.91836735,  5.40816327,
        5.89795918,  6.3877551 ,  6.87755102,  7.36734694,  7.85714286,
        8.34693878,  8.83673469,  9.32653061,  9.81632653, 10.30612245,
       10.79591837, 11.28571429, 11.7755102 , 12.26530612, 12.75510204,
       13.24489796, 13.73469388, 14.2244898 , 14.71428571, 15.20408163,
       15.69387755, 16.18367347, 16.67346939, 17.16326531, 17.65306122,
       18.14285714, 18.63265306, 19.12244898, 19.6122449 , 20.10204082,
       20.59183673, 21.08163265, 21.57142857, 22.06122449, 22.55102041,
       23.04081633, 23.53061224, 24.02040816, 24.51020408, 25.        ])

In [13]:
my_dict = {'Name':"Rabin" , "Age":"19"}
my_dict.values()

dict_values(['Rabin', '19'])

In [14]:
my_dict.items()

dict_items([('Name', 'Rabin'), ('Age', '19')])

In [15]:
my_dict.keys()

dict_keys(['Name', 'Age'])

In [16]:
my_dict['Height'] = 1.3

In [17]:
my_dict

{'Name': 'Rabin', 'Age': '19', 'Height': 1.3}

In [2]:
import numpy as np
import pandas as pd

In [21]:
Array = np.array([[1,2] , [3,4], [5,6]])

In [26]:
pd.DataFrame(Array , columns=['Column1','Column2'],index=["Row1","Row2","Row3"])

      Column1  Column2
Row1        1        2
Row2        3        4
Row3        5        6

In [ ]:
#Dictonary in pandas
States = ['California' , 'New York', 'los Angeles', 'Missouri']
Population = ['1234232', '14342353', '6767543', '2534546']
s_p_dict = {'States': States , 'Population':Population}
pd.DataFrame(s_p_dict)

        States Population
0   California    1234232
1     New York   14342353
2  los Angeles    6767543
3     Missouri    2534546

In [3]:
students = pd.read_csv('StudentsPerformance.csv')

In [ ]:
#Displaying dataframe
students

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [ ]:
#Acessing first 5 row in dataframe
students.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [6]:
#Acessing last 5 row in DataFrame
students.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86